#include <iostream>
using namespace std;

int menu() {
    int choice; // вводит функцию choice которая является цифрой

    while (true) { // нужно чтобы меню показывалось после выбора опции
    cout <<"Добро пожаловать в меню! Пожалуйста выберите опции:\n";
    cout <<"1. Регламент рабочего времени\n";
    cout <<"2. Обязанности лаборанта по проверке ПО\n";
    cout <<"3. Правила материальной отвественности\n";
    cout <<"4. Пример дисциплинарного взыскания\n"
    cout <<"5. Выйти из меню\n";
    cin >> choice; // cin получает то что написал пользователь и кидает это в функцию choice

    switch (choice) { // проверяет функцию choice
        case 1:
            cout <<"Регламент рабочего времени на полставки лаборанта\n ПН: БПЛА-25-2 8:00-8:50, БПЛА-25-4 9:05-9:55, АБиС 10:10-11:00, 11:15-12:05. \nВТ: Мех 9:05-9:55, БПЛА-25-6 10:10-11:00, ОАД 10:10-11:00, 11:15-12:05. \nСР: Авионики 10:10-11:00, 11:15-12:05, БПЛА-25-4 13:10-14:00, 14:15-15:05. \nЧТ: АБиС 8:00-8:50, 9:05-9:55, Мех 10:10-11:00, 11:15-12:05. \nПТ: ОАД 8:00-8:50, 9:05-9:55, Авионики 10:10-11:00, 11:15-12:05.\n";
            break;
        case 2:
            cout <<"Лаборант обязан проверять работоспособность самих компьютеров (мониторы, гарнитура, системник), проверки работы пустой ОС и правильную работу программ перед началом занятий. Лаборант должен помогать студентам с возможными появишимеся проблемами и объяснять природу этих проблем. Лаборант не несёт отвественности за действия студентов.\n";
            break;
        case 3:
            cout <<"Общие правила безопастности для любых аудиторий здесь актуальны. Лаборант должен хранить компьютерные комплектующие, предназначенные для демонстраций, под столом преподавателя. Лаборант должен предотвращять порчу имущества и сообщать о нарушителях в администрацию\n";
            break;
        case 4:
            cout <<"Самовольный вынос учебного, настроенного ноутбука №7 за пределы учебного кабинета и срыв учебного процесса.\n Были нарушены уставы ВУЗа:\n 1. Нарушение правил использования и сохранности имущества. Лаборант превысил свои полномочия и вынес имущество Академии без согласования с администрацией. \n 2. Грубое нарушение трудовых обязанностей. Лаборант не смог проследить за сохранностью имущества Академии. \n 3. Срыв учебной деятельности. Действия лаборанта не позволили полноценно провести занятие. \n. Требуется дисциплинарное взыскание в виде возврата имущества Академии, а также уплаты штрафа в виде 50,000 тенге либо сверхурочной работы на протяжении двух рабочих недель. \n";
        case 5:
            {
                int answer;
                while (true) {
                    cout<<"Сколько в неделю часов работает лаборант на полставки?\n";
                    cin >> answer;

                    if (answer == 20) {
                        cout << "Правильный ответ, спасибо за использование!\n";
                        return 0;
                    } else {
                        cout << "Неправильный ответ, попробуйте ещё\n";
                    }
                }
            }
            break;
        default:
            cout <<"Syntax error!\n";
            break;
    }
    }
    return 0;
}
void premenu() {
    int workdays;
    double stavka; // позволяет вводить дробные числа
    double workinghours;
    double weekworkhours = workdays * workinghours;
    const double standard_workinghours = 8.0; // константа при ставке 1.0
    cout << "Прежде чем прейти в меню, введите кол/во рабочих дней и ставку (0.5, 1.0, 1.5 и т.д).\n";
    cin >> workdays >> stavka;

    while (true) {cout << "Введите длительность рабочего дня в часах.\n";
    cin >> workinghours;
    double correctworkinghours = standard_workinghours * stavka;
    double correctweekworkinghours = correctworkinghours * workdays;
    if (workinghours == correctworkinghours) {
        cout << "Данные, введены правильно, приступайте к меню.\n" << endl;
        menu ();
        break;
    } else {
        cout << "Ошибка! При " << workdays << "-дневной рабочей неделе " << workinghours <<" часа в день составляют " << weekworkhours << " часов в неделю. Разница рабочего времени: " << correctweekworkinghours - weekworkhours << " (" << correctweekworkinghours/weekworkhours * 100 << "% от нормы ставки " << stavka << "). Налицо факт предоставления заведомо ложных сведений работодателю. Попробуйте ввести снова.\n";
    }
}
}
int main () {
    premenu ();
    return 0;
}